<html>
<head>
<title>Anleitung zum Erstellen eines Alexa Soloabenteuers</title>
<meta charset="UTF-8">
<meta http-equiv="cache-control" content="no-cache" />
<meta http-equiv="pragma" content="no-cache" />
</head>
<body>
		
<h1>Eigene Soloabenteuere f&uuml;r Alexa erstellen</h1>

<p>
Der Alexa "Rollenspiel" Skill erlaubt es eigene Soloabenteuer zu erstellen und zu ver&ouml;ffentlichen.
Die Abenteuer werden dabei als Textdatei erstellt.
Das Format ist vorgegeben und wird in dieser Anleitung erl&auml;utert.
</p>

<p>
Im Browser kannst du unter <a href="https://calcbox.de/solo/solo/generator.jsp">https://calcbox.de/solo/solo/generator.jsp</a> zun&auml;chst ein Testspiel im Textmodus eingeben.
Mit einem Klick auf den Button "Pr&uuml;fen" wird die Syntax des eingegebenen Abenteuers &uuml;berp&uuml;ft.
Ist alles Korrekt, dann erscheint ein Link um ein Testspiel im Text-Simulator zu machen.
Die Validierung ist noch nicht sehr gut. So werden z.B. Referenzen auf nicht existierende Kapitel erst w&auml;hrend des Spiels erkannt und dann erscheint eine Exception. Der Text der Exception sollte allerdings helfen, den Fehler zu finden.
</p>

<p>   
Wenn im Textsimulator alles zu Deiner Zufriedenheit funktioniert, 
dann kannst Du das Soloabenteuer mit dem Link "Upload zu Alexa" auf deine Alexa hochladen.
Das Spiel ist dann zun&auml;chst nur auf deiner Alexa sichtbar und kann von dir mit Sprachsteuerung getestet werden.
</p>

<p>
WICHTIG: Die Alexa Sprachsteuerung erlaubt es nicht mehr beliebige W&ouml;rter zu erkennen. 
D.h., alle zu erwartenden W&ouml;rter m&uuml;ssen vorher als Liste hinterlegt werden. 
Wenn Du bei einer Entscheidung oder einem R&auml;tsel ein neues Wort verwendest, 
dann kann es sein, dass Alexa dieses Wort nicht erkennt. 
Verwende deshalb immer auch die A/B/C Varianten als alternative Spracheingabe.
</p>

<p>
Wenn Dein Soloabenteuer fertig ist, dann sende eine Mail an ferenc.hechler(AT)gmail.com, 
ich werde es dann freischalten und die neuen Entscheidungs-/R&auml;tsel-W&ouml;rter mit aufnehmen. 
</p>
    
<p>
Wenn Du Hilfe brauchst, bitte ebenfalls einfach per Mail kontaktieren.
</p>

<p>
Wenn Dein Abenteuer bereits als PDF vorhanden ist, 
Du aber keine Lust hast, dass selbst in das Textformat umzuwandeln, 
dann kontaktiere mich ebenfalls per EMail, 
vielleicht findet sich ein Freiwilliger, der das &uuml;bernimmt.  :-)<br>
Voraussetzung ist nat&uuml;rlich, dass Du alle Rechte an dem Soloabentuere besitzt!
</p>

<p>
Nun aber zur eigentlichen Anleitung.
</p>

<h2 id="inhalt">Inhaltsverzeichnis</h2>

<p>Die folgenden Sprachelemente k&ouml;nnen in Soloabenteuern verwendet werden.</p>

<ul>
<li><a href="#sub_beispiel">Beispiel Quelltext "Das Kennenlernabenteuer"</a></li>
<li><a href="#sub_janeinentscheidung">JANEINENTSCHEIDUNGEN</a></li>
<li><a href="#sub_entscheidung">ENTSCHEIDUNG</a></li>
<li><a href="#sub_auswahlmitruecksprung">AUSWAHLMITR&Uuml;CKSPRUNG</a>
<li><a href="#sub_ruecksprung">R&Uuml;CKSPRUNG</a>
<li><a href="#sub_zufallsentscheidung">ZUFALLSENTSCHEIDUNG</a>
<li><a href="#sub_aktion">AKTION</a></li>
<li><a href="#sub_probe">PROBE</a></li>
<li><a href="#sub_kampf">KAMPF</a></li>
<li><a href="#sub_regel">REGEL</a></li>
<li><a href="#sub_weiter">WEITER</a></li>
<li><a href="#sub_raetsel">R&Auml;TSEL</a></li>
<li><a href="#sub_audio">AUDIO</a></li>
<li><a href="#sub_phonem">PHONEM</a></li>
<li><a href="#sub_voice">VOICE</a></li>
</ul>


<h2 id="sub_beispiel">Beispiel Quelltext "Das Kennenlernabenteuer"</h2>

Hier der Quelltext des "Kennenlernabenteuers", wie es bereits ver&ouml;ffentlicht wurde.
Dieses Abenteuer dient in erster Linie dazu, alle Sprachelemente kennen zu lernen. 
Dieses Abenteuer kann gerne als Muster f&uuml;r eigene Entwicklungen verwendet werden.

<p>
<textarea readonly rows="20" cols="80">
TITEL: Kennenlernabenteuer
ERFAHRUNGSSTUFEN: 1-3
REGELWERK: DSA 4.1
DAUER: 5 Minuten
ORT: 
AUTOR: Ferenc Hechler
ERSCHIENEN: 22. Januar 2017
LETZTEAKTUALISIERUNG:  
LIZENZ: Creative Commons BY
LIZENZURL: https://creativecommons.org/licenses/by/3.0/de/
EMAIL: ferenc.hechler@gmail.com
WEBSEITE: https://calcbox.de/solo/solo/anleitung.html
AUDIOBASEURL: https://calcbox.de/audio

KURZBESCHREIBUNG:
Dies ist ein sehr kurzes Beispiel Soloabenteuer nach den Schwarze Auge Regeln.
Ziel ist es, die Sprachsteuerung mit Alexa kennen zu lernen.
Um das Soloabenteuer zu spielen ben&ouml;tigst Du einen Helden mit einem Charakterbogen,
auf dem Deine Werte notiert sind. 


ANMERKUNG:
DAS SCHWARZE AUGE, AVENTURIEN und DERE sind eingetragene Marken der Ulisses Medien und Spiel Distribution GmbH oder deren Partner.
Copyright der Audio Dateien: (c) Michael Hilprecht (Hillus), https://dlalt.orkenspalter.de/?s=Hillus


[BEGINN]
Es ist sp&auml;t Abends und du hast dir gerade einen gem&uuml;tlichen Platz im 
kleinen Gasthaus "Zum Kobold" ausgesucht.
Du hast Hunger.

JANEINENTSCHEIDUNG: 
M&ouml;chtest du etwas essen?
JA:   Du rufst den Wirt an Deinen Tisch. [1]
NEIN: [SCHNELLENDE]


[1]
Was m&ouml;chtest du bestellen?

ENTSCHEIDUNG: 
Es gibt (A) Suppe f&uuml;r 5 Heller, (B) Braten f&uuml;r 1 Silbertaler oder (C) nur ein Bier f&uuml;r 6 Kreuzer. 
A: [2] = Suppe 
B: [3] = Braten 
C: [4] = Bier 


[2]
Der Wirt bringt Dir eine leckere hei&szlig;e Gem&uuml;sesuppe.

AKTION:
Ziehe dir 5 Heller ab.

WEITER: [5]


[3]
Der Wirt bringt Dir eine gro&szlig;en Teller mit Schweinebraten.

AKTION:
Ziehe dir 1 Silbertaler ab.

WEITER: [5]


[4]
Der Wirt bringt Dir ein Bier mit schaumiger Krone.

AKTION:
Ziehe dir 6 Kreuzer ab.

WEITER: [5]


[5]
Am Nachbartisch sitzen drei Leute, trinken Bier und unterhalten sich sehr aufgeregt.
Du kannst nicht genau h&ouml;ren, worum es geht. 

JANEINENTSCHEIDUNG:
M&ouml;chtest du dich an den Nachbartisch setzen?
NEIN: [SCHNELLENDE]
JA: [6]


[6]
Du gehst zum Nachbartisch.

REGEL:
BESUCHT(4): [11]
WEITER:

Der &auml;lteste spricht dich an: "Das hier ist der Biertisch, verschwinde".
Du gehst wieder an Deinen Tisch.
WEITER: [1] 


[7]
Im weiteren Gespr&auml;ch erf&auml;hrst Du, dass oben auf dem Speicher des Gasthauses 
eine Riesenspinne wohnt.

PROBE:
Mut
FEHLGESCHLAGEN: [8]
BESTANDEN:      [9]


[8]
Du trinkst nochmal einen tiefen Schluck Bier und &uuml;berlegst es Dir noch einmal.

PROBE:
Mut - 5
FEHLGESCHLAGEN: [8]
BESTANDEN:      [9]


[9]
Mutig begibst du dich zum Speicher.
Du kletterst die Leiter hoch und &ouml;ffnest die Luke.
AUDIO: Tuerknarren.mp3
Du betrittst einen gro&szlig;en Raum. 
AUDIO: Schritte.mp3
Pl&ouml;tzlich schliesst sich hinter Dir die Luke.
AUDIO: Tuer-zuschlagen.mp3
Im Dunkeln funkeln Dich zwei rot gl&uuml;hende Augen an.

Du wirst von einer Riesenspinne angegriffen.

KAMPF:
GEGNER: Riesenspinne
WAFFE: Biss
TP: 1W6 + 2 
AT: 7 
PA: 6 
LEP: 10 
RS: 1 

VERLOREN: [SCHNELLENDE]
GEWONNEN: [10]
 
 
[10]
Du kehrst an den Biertisch zur&uuml;ck und erz&auml;hlst von Deiner Heldentat.
Die Anwesend sind hoch erfreut und begl&uuml;ckw&uuml;nschen Dich:

AKTION:
Du bekommst von jedem 2 Silbertaler.
Ausserdem erh&auml;ltst Du f&uuml;r das erfolgreiche Abschlie&szlig;en des Abenteuers 15 Erfahrungspunkte.
WEITER: [ENDE] 


[11]
Du wirst freundlich begr&uuml;&szlig;t und sie sto&szlig;en mit Deinem Bier an.
Einer der M&auml;nner, ein Matrose, mustert Dich und sagt: 
Ich will deinen Verstand auf die Probe Stellen.
Mal sehen, ob du folgendes R&auml;tsel l&ouml;sen kannst, Du hast drei Versuche: 

R&Auml;TSEL:
Wenn man es braucht,
wirft man es weg!
wenn man es nicht braucht,
holt man es wieder zur&uuml;ck!
ANTWORT(Anker): Richtig, der Matrose schaut dich anerkennend an. [7]
ANTWORT(Angel): Nicht ganz, aber die L&ouml;sung f&auml;ngt mit den gleichen beiden Buchstaben an.
FEHLVERSUCHE(1): Ein Tipp: "Man braucht es im Meer". 
FEHLVERSUCHE(2): Noch ein Tipp: "Es geh&ouml;rt zu jedem Schiff". 
FEHLVERSUCHE(3): Leider hat Dein Verstand die Biertischmitglieder nicht &uuml;berzeugt. [SCHNELLENDE]
AUFGEBEN: [SCHNELLENDE]


[SCHNELLENDE]
Damit ist das Abenteuer auch schon zu Ende.
Viel Erfolg beim n&auml;chsten mal.
WEITER: [ENDE]


[ENDE]
Ich hoffe, dieses Abenteuer hat Spa&szlig; gemacht und ich w&uuml;rde mich &uuml;ber Lob, Kritik
und Verbesserungsvorschl&auml;ge freuen. Meine EMail Adresse ist ferenc.hechler@gmail.com. 
</textarea> 
</p>

<p>
Beschreibung der Sprachelemente:
</p>



<pre>
Aufbau der Textdatei:

Kopfzeilen: Titel, Autor, und sonstige Infos
Kurzbeschreibung: Der Text, den Alexa vorliest, wenn das Soloabenteuer ausgew&auml;hlt wird. 
[BEGINN]
 &lt;Text&gt;
 &lt;Schl&uuml;sselw&ouml;rter&gt;
[&lt;Kapitel&gt;]
 &lt;Text&gt;
 &lt;Schl&uuml;sselw&ouml;rter&gt;
[&lt;Kapitel&gt;]
...
[ENDE]
 &lt;Text&gt;


Die Kapitel sind jeweils in eckigen Klammern gesetzt, z.B.: "[1]"
Es gibt zwei ausgezeichnete Kapitel: "[BEGINN]" und "[ENDE]"

Es gibt mehrere Schl&uuml;sselw&ouml;rter, die in einem Kapitel verwendet werden k&ouml;nnen.
Schl&uuml;sselw&ouml;rter sind Gro&szlig;geschrieben und stehen jeweils am Anfang einer Zeile und werden mit einem Doppelpunkt (":") abgeschlossen.

Aktuell gibt es die folgenden Schl&uuml;sselw&ouml;rter:
"JANEINENTSCHEIDUNG", "ENTSCHEIDUNG", "AKTION", "PROBE", "KAMPF", "REGEL", "WEITER", "R&Auml;TSEL"

Ich erspare mir jetzt eine formale Beschreibung der Syntax, sondern mache jeweils ein Beispiel:

[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_janeinentscheidung">JANEINENTSCHEIDUNGEN</h2>

Als erstes gibt es die Ja-/Nein-Entscheidung
[---------------]
JANEINENTSCHEIDUNG:
&lt;Ja-Nein-Frage&gt;
JA:   [&lt;Ja-Kapitel&gt;]
NEIN: [&lt;Nein-Kapitel&gt;]
[---------------]

Beispiel aus dem Kapitel BEGINN:
[---------------]
JANEINENTSCHEIDUNG:
M&ouml;chtest du den Fremden fragen was los ist?
JA:   [1]
NEIN: [3]
[---------------]

Bei einer Ja-Nein Entscheidung wird die Frage, so wie angegeben vorgelesen und auf eine Ja-Nein-Antwort gewartet. Danach wird mit dem entsprechenden Kapitel weiter gemacht.


[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_entscheidung">ENTSCHEIDUNG</h2>

F&uuml;r komplexeren Fragestellung gibt es die Auswahl-Entscheidung mit dem Schl&uuml;sselwort ENTSCHEIDUNG:
[---------------]
ENTSCHEIDUNG:
&lt;Alternativen-Frage&gt;
A: [&lt;Kapitel&gt;] = &lt;Spracherkennungsfloskel1&gt; | &lt;Spracherkennungsfloskel2&gt; |  ...
B: [&lt;Kapitel&gt;] = ...
C: ...
...
[---------------]

Beispiel
[---------------]
ENTSCHEIDUNG:
M&ouml;chtest du (A) die Spuren genauer untersuchen oder (B) das umliegende Gebiet genauer in Augenschein nehmen? Nat&uuml;rlich steht dir (C) auch frei wieder umzukehren.
A: [14] = Spuren
B: [15] = Gebiet
C:  [9] = Umkehren
[---------------]


[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_auswahlmitruecksprung">AUSWAHLMITR&Uuml;CKSPRUNG</h2>

Auswahl mit R&uuml;cksprung erlaubt es ein Kapitel von verschiedenen Stellen aus aufzurufen und dann zur Auswahl zur&uuml;ck zu springen.
Es kann beliebig oft zu einem ausgew&auml;hlten Kapitel verzweigt werden. 
Sobald im Unterkapitel auf einen R&Uuml;CKSPRUNG gestossen wird, wird zur&uuml;ck zur Auswahl gesprungen.
Die Auswahl wird mit "Fertig" beendet und das aktuelle Kapitel wird fortgesetzt.   

[---------------]
AUSWAHLMITR&Uuml;CKSPRUNG:
&lt;Auswahlm&ouml;glichkeiten&gt;
A: [&lt;Kapitel&gt;] = &lt;Spracherkennungsfloskel1&gt; | &lt;Spracherkennungsfloskel2&gt; |  ...
B: [&lt;Kapitel&gt;] = ...
C: ...
...
[---------------]

Beispiel
[---------------]
[1]
AUSWAHLMITR&Uuml;CKSPRUNG:
Du kannst dem W&auml;chter fragen stellen: (A) Wie ist das Wetter? (B) Wo bin ich? (C) Wie viel Uhr ist es?
A: [101] = Wetter
B: [102] = Ort
C: [103] = Uhrzeit
Jetzt bist du Schlauer.
WEITER: [200]

[101]
Es regnet.
R&Uuml;CKSPRUNG:

[102]
In London.
R&Uuml;CKSPRUNG:

[---------------]


[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_ruecksprung">R&Uuml;CKSPRUNG</h2>

Endet ein Kapitel R&Uuml;CKSPRUNG, dann wird zur&uuml;ck zur AUSWAHLMITR&Uuml;CKSPRUNG gesprungen, von der aus zuletzt verzweigt wurde.
[---------------]
R&Uuml;CKSPRUNG:
[---------------]

[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_zufallsentscheidung">ZUFALLSENTSCHEIDUNG</h2>

Verzweigt zuf&auml;llig zu einem der aufgef&uuml;hrten Kapitel. Die Wahrscheinlichkeit ist f&uuml;r jedes Kapitel gleich gro&szlig;.

[---------------]
ZUFALLSENTSCHEIDUNG:
A: [&lt;Kapitel&gt;]
B: [&lt;Kapitel&gt;]
C: ...
...
[---------------]

Beispiel
[---------------]
ZUFALLSENTSCHEIDUNG:
A: [110]
B: [120]
C: [130]
[---------------]

[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_aktion">AKTION</h2>

Muss der Solo-Spieler eine Aktion machen, wie, z.B. einen Schaden eintragen, dann wird das mit dem Schl&uuml;sselwort "AKTION" gemacht.
[---------------]
AKTION:
&lt;Anweisungstext&gt;

WEITER:
[---------------]

Beispiel 
[---------------]
AKTION:
Du darfst je 1W6 Lebenspunkte und Astralpunkte regenerieren.

WEITER:
[---------------]

Im Spiel wird der Anwesiungstext vorgelesen und eine Pause eingelegt, bis der Solo-Spieler die Aktion ausgef&uuml;hrt hat. Der Spieler kann sich den Anweisungstext auch wiederholen lassen.
Wurde die Aktion ausgef&uuml;hrt, dann wird das aktuelle Kapitel an der Stelle "WEITER:" fortgesetzt.

Eine Aktion ist lediglich eine Pause und hat keinen Einfluss auf den Spielverlauf.

[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_probe">PROBE</h2>

Proben: Eine Probe hat zwei m&ouml;gliche Ausg&auml;nge: Bestanden oder Fehlgeschlagen
[---------------]
PROBE:
&lt;Eigenschaft&gt;
BESTANDEN: &lt;optionaler-Kommentar&gt; [&lt;Kapitel&gt;]
FEHLGESCHLAGEN:&lt;optionaler-Kommentar&gt; [&lt;Kapitel&gt;]
[---------------]

Beispiel
[---------------]
PROBE:
Sinnensch&auml;rfe
BESTANDEN: Du Bist scharfsinnig wie eine Katze [24]
FEHLGESCHLAGEN: Du bist blind wie ein Maulwurf [28]
[---------------]

Wie bei der Ja-/Nein-Entscheidung wird das Spiel im entsprechenden Kapitel fortgesetzt. Optional kann ein Kommentar zum Ausgang der Probe gegeben werden.


[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_kampf">KAMPF</h2>

In einem Kampf werden die Gegener mit Ihren Werten gelistet
[---------------]
KAMPF:
GEGNER: &lt;Gegner-name-1&gt;
WAFFE: &lt;waffenname&gt; INI &lt;initiativenwert&gt;
AT: &lt;wert&gt;
PA: &lt;wert&gt;
TP: ...
...
MR: &lt;wert&gt;

GEGNER: &lt;Gegner-name-2&gt;
WAFFE: ...

GEWONNEN: &lt;optionaler-Kommentar&gt; [&lt;Kapitel&gt;]
VERLOREN: &lt;optionaler-Kommentar&gt; [&lt;Kapitel&gt;]
[---------------]

Beispiel
[---------------]
KAMPF:
GEGNER: Goblin
WAFFE: Ast; Initiative 4+1W6
AT: 7
PA: 6
TP: 1W6-1
DK: H
LeP: 15
RS: 1
AuP: 15
WS: 3
GS: 5
MR: 0

GEWONNEN: [43]
VERLOREN: Du trittst die lange Reise zu Boron an [31]
[---------------]


[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_regel">REGEL</h2>

Es kann spezielle Regeln geben, die den Spielflu&szlig; beeinflussen.
Die einzige bisher verwendete Regel ist "BESUCHT(&lt;Kapitel&gt;)". Diese ist erf&uuml;llt, wenn ein Kapitel im bisherigen Spielverlauf schon mal besucht wurde.
Von oben nach unten werden alle Regeln gepr&uuml;ft und zum Kapitel der ersten passende Regel weitergeleitet.
Die Regel SONST greift immer dann, wenn keine andere Regel passt.
[---------------]
REGEL:
&lt;Bedingung-1&gt;: [&lt;Kapitel&gt;]
&lt;Bedingung-2&gt;: ...
...
[---------------]

Beispiel
[---------------]
REGEL:
BESUCHT(29): [33]
SONST: [36]
[---------------]
Wurde Kapitel 29 bereits besucht, dann wird mit Kapitel 33 weitergemacht, ansonsten mit Kapitel 36.


[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_weiter">WEITER</h2>

Mit dem Schl&uuml;sselwort "WEITER" wird der Spielfluss in einem anderen Kapitel fortgesetzt werden.
[---------------]
WEITER: [&lt;Kapitel&gt;]
[---------------]

Beispiel
[---------------]
Du f&uuml;hrst einen letzten Hieb aus, woraufhin der Rotpelz leblos zu Boden sinkt.
Du wendest dich nun der Kiste zu.
WEITER: [44]
[---------------]


[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_raetsel">R&Auml;TSEL</h2>

Ein neues Element auf Anregung von Franziska Hechler sind R&auml;tsel.
Bei normalen Entscheidungen werden die Auswahlm&ouml;glichkeiten aufgez&auml;hlt.
Im Gegensatz dazu werden die Auswahlm&ouml;glichkeiten eines R&auml;tsels nicht verraten.
[---------------]
R&Auml;TSEL:    
Atemlos lebt es,
kalt wie der Tod schwebt es,
f&uuml;hlt keinen Durst und doch trinkt es,
tr&auml;gt ein Kettenhemd und nie klingt es.
ANTWORT(Fisch):  Sehr gut [72] 
ANTWORT(Gollum):  [73]
ANTWORT(Tolkien):  [73]
FEHLVERSUCHE(2): Denk an Wasser
FEHLVERSUCHE(4): Noch ein Versuch
FEHLVERSUCHE(5): [71]
AUFGEBEN: [74]
[---------------]

[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_audio">AUDIO</h2>

Alexa kann nicht nur Text vorlesen, sondern auch MP3 Dateien abspielen.
Die MP3 Dateien m&uuml;ssen daf&uuml;r gewisse Bedingungen erf&uuml;llen, siehe unten.
In den Header-Daten muss dazu eine Basis-URL angegeben werden unter der sich die MP3-Dateien befinden.

[---------------]
AUDIOBASEURL: &lt;URL&gt;

&lt;text&gt;
AUDIO: &lt;MP3-filename&gt;
&lt;text&gt;
...
[---------------]

Beispiel
[---------------]
TITEL: Audio Test 
AUDIOBASEURL: https://calcbox.de/audio
...


Du &ouml;ffnest das Tor.
AUDIO: Tuerknarren.mp3
Du betritts den Garten.
...
[---------------]

<b>Anforderungen an die MP3 Datei</b>
Die MP3 Datei muss als "https" erreichbar sein, nur "http" geht nicht.
In einer Antwort k&ouml;nnen maximal 5 Audiodateien enthalten sein.
Die Gesamtzeit der Audio-Dateien in einer Antwort darf 90 Sekunden nicht &uuml;berschreiten.
Die Audiodatein m&uuml;ssen f&uuml;r Alexa in ein bestimmtes Format umgewandelt werden. 
Details dazu befinden sich auf der <a href="https://developer.amazon.com/public/solutions/alexa/alexa-skills-kit/docs/speech-synthesis-markup-language-ssml-reference#h3_converting_mp3">Amazon Entwicklerseite</a></p>
Wie dort beschrieben k&ouml;nnen beliebige MP3 Dateien mit <a href="https://www.ffmpeg.org/">ffmpeg</a> auf der Komandozeile konvertiert werden:
[---------------]
ffmpeg -i &lt;eingabe.mp3&gt; -ac 2 -codec:a libmp3lame -b:a 48k -ar 16000 &lt;ausgabe.mp3&gt;
[---------------]

[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_phonem">PHONEM</h2>

Gerade die Rollenspiel-Namen sind f&uuml;r Alexa nicht immer leicht auszusprechen.
Deshalb besteht die M&ouml;glichkeit nach den Header-Daten mehrere W&ouml;rter in Lautschrift zu definieren.

[---------------]
&lt;header-info&gt;

PHONEM(&lt;wort1&gt;=&lt;x-sampa-phonem&gt;)
PHONEM(&lt;wort2&gt;=&lt;x-sampa-phonem&gt;)
...

[BEGINN]
...
[---------------]

Das Phonem-Format x-sampa ist hier definiert: <a href="https://developer.amazon.com/public/solutions/alexa/alexa-skills-kit/docs/speech-synthesis-markup-language-ssml-reference#p">Amazon SSML Reference</a> 

Beispiel
[---------------]
PHONEM(Punin): "pu:nIn
PHONEM(Tsa): ts"a:
PHONEM(Praios): Pra:ios
[---------------]

Mit diesen Definitionen, werden alle Vorkommen von diesen W&ouml;rtern (Ganzes Wort, inklusive Gro&szlig;-/Kleinschreibung) 
von Alexa entsprechend den Phonemen ausgesprochen. Ansonsten w&uuml;rde Punin wie "Pannin" ausgesprochen und Tsa wird als "T-S-A" buchstabiert.

[<a href="#inhalt">zum Inhaltsverzeichnis</a>]
<h2 id="sub_voice">VOICE</h2>

Wenn Du wörtliche Rede verwenden möchtest, dann kannst du (in Grenzen) Alexas Stimme modulieren, 
also sie lauter/leiser, höher/tiefer und langsamer/schneller sprechen lassen.
Die Stimm-Einstellungen werden im Header definiert: 

[---------------]
&lt;header-info&gt;

VOICE(&lt;name1&gt;): volume="&lt;+/-dezibel1&gt;db" pitch="&lt;+/-pitch1&gt;%" rate="&lt;rate1&gt;%")
VOICE(&lt;name2&gt;): volume="&lt;+/-dezibel2&gt;db" pitch="&lt;+/-pitch2&gt;%" rate="&lt;rate2&gt;%")
...

[BEGINN]
...
[---------------]

Das Bedeutung von volume / pitch und rate ist ist hier definiert: <a href="https://developer.amazon.com/public/solutions/alexa/alexa-skills-kit/docs/speech-synthesis-markup-language-ssml-reference#prosody">Amazon SSML Reference</a> 

Beispiel Deklaration:
[---------------]
VOICE(FRAU): volume="-1dB" pitch="+20%" rate="105%"
VOICE(MANN): volume="+1dB" pitch="-15%" rate="97%"
[---------------]

Mit diesen Definitionen, werden Texte, die mit einer "V_&lt;name&gt;(...)" Klammer umschlossen sind, mit der entsprechenden Stimmmodulation ausgesprochen. Der Text in Klammern wird als eigener Absatz gesprochen, das bedeutet davor und danach wird eine kurze Pause gemacht.

Beispiel Text:
[---------------]
Sie trat auf ihn zu und sprach: V_FRAU("Was suchst Du hier?")
V_MANN("Den Schatz!") antwortete er.
[---------------]

[<a href="#inhalt">zum Inhaltsverzeichnis</a>]

</pre>

</body>
</html>